#### GradientType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "GradientType" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum GradientType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration GradientType ``` |

| Visual C++ |
| --- |
| ``` public enum class GradientType ``` |

# Members

| Member name | Description |
| --- | --- |
| Fourcorner |  |
| Box |  |
| Diagonal |  |
| Lighting |  |
| Linear |  |
| Mapped |  |
| Normal |  |
| Pong |  |
| Radial |  |
| Spiral |  |
| Sweep |  |
| Tartan |  |

# See Also

Autodesk.Revit.DB.Visual Namespace